bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/sec_eng_reg.h
/* 0x140 : se_aes_0_key_sel */
#define SEC_ENG_SE_AES_0_KEY_SEL_OFFSET (0x140)
#define SEC_ENG_SE_AES_0_KEY_SEL        SEC_ENG_SE_AES_0_KEY_SEL
#define SEC_ENG_SE_AES_0_KEY_SEL_POS    (0U)
#define SEC_ENG_SE_AES_0_KEY_SEL_LEN    (2U)
#define SEC_ENG_SE_AES_0_KEY_SEL_MSK    (((1U << SEC_ENG_SE_AES_0_KEY_SEL_LEN) - 1) << SEC_ENG_SE_AES_0_KEY_SEL_POS)
#define SEC_ENG_SE_AES_0_KEY_SEL_UMSK   (~(((1U << SEC_ENG_SE_AES_0_KEY_SEL_LEN) - 1) << SEC_ENG_SE_AES_0_KEY_SEL_POS))

/* 0x144 : se_aes_1_key_sel */
// #define SEC_ENG_SE_AES_1_KEY_SEL_OFFSET                         (0x144)
// #define SEC_ENG_SE_AES_1_KEY_SEL                                SEC_ENG_SE_AES_1_KEY_SEL
// #define SEC_ENG_SE_AES_1_KEY_SEL_POS                            (0U)
// #define SEC_ENG_SE_AES_1_KEY_SEL_LEN                            (2U)
// #define SEC_ENG_SE_AES_1_KEY_SEL_MSK                            (((1U<<SEC_ENG_SE_AES_1_KEY_SEL_LEN)-1)<<SEC_ENG_SE_AES_1_KEY_SEL_POS)
// #define SEC_ENG_SE_AES_1_KEY_SEL_UMSK                           (~(((1U<<SEC_ENG_SE_AES_1_KEY_SEL_LEN)-1)<<SEC_ENG_SE_AES_1_KEY_SEL_POS))

/* 0x148 : se_aes_0_endian */
#define SEC_ENG_SE_AES_0_ENDIAN_OFFSET    (0x148)
#define SEC_ENG_SE_AES_0_DOUT_ENDIAN      SEC_ENG_SE_AES_0_DOUT_ENDIAN
#define SEC_ENG_SE_AES_0_DOUT_ENDIAN_POS  (0U)
#define SEC_ENG_SE_AES_0_DOUT_ENDIAN_LEN  (1U)
#define SEC_ENG_SE_AES_0_DOUT_ENDIAN_MSK  (((1U << SEC_ENG_SE_AES_0_DOUT_ENDIAN_LEN) - 1) << SEC_ENG_SE_AES_0_DOUT_ENDIAN_POS)
#define SEC_ENG_SE_AES_0_DOUT_ENDIAN_UMSK (~(((1U << SEC_ENG_SE_AES_0_DOUT_ENDIAN_LEN) - 1) << SEC_ENG_SE_AES_0_DOUT_ENDIAN_POS))
#define SEC_ENG_SE_AES_0_DIN_ENDIAN       SEC_ENG_SE_AES_0_DIN_ENDIAN
#define SEC_ENG_SE_AES_0_DIN_ENDIAN_POS   (1U)
#define SEC_ENG_SE_AES_0_DIN_ENDIAN_LEN   (1U)
#define SEC_ENG_SE_AES_0_DIN_ENDIAN_MSK   (((1U << SEC_ENG_SE_AES_0_DIN_ENDIAN_LEN) - 1) << SEC_ENG_SE_AES_0_DIN_ENDIAN_POS)
#define SEC_ENG_SE_AES_0_DIN_ENDIAN_UMSK  (~(((1U << SEC_ENG_SE_AES_0_DIN_ENDIAN_LEN) - 1) << SEC_ENG_SE_AES_0_DIN_ENDIAN_POS))
#define SEC_ENG_SE_AES_0_KEY_ENDIAN       SEC_ENG_SE_AES_0_KEY_ENDIAN
#define SEC_ENG_SE_AES_0_KEY_ENDIAN_POS   (2U)
#define SEC_ENG_SE_AES_0_KEY_ENDIAN_LEN   (1U)
#define SEC_ENG_SE_AES_0_KEY_ENDIAN_MSK   (((1U << SEC_ENG_SE_AES_0_KEY_ENDIAN_LEN) - 1) << SEC_ENG_SE_AES_0_KEY_ENDIAN_POS)
#define SEC_ENG_SE_AES_0_KEY_ENDIAN_UMSK  (~(((1U << SEC_ENG_SE_AES_0_KEY_ENDIAN_LEN) - 1) << SEC_ENG_SE_AES_0_KEY_ENDIAN_POS))
#define SEC_ENG_SE_AES_0_IV_ENDIAN        SEC_ENG_SE_AES_0_IV_ENDIAN
#define SEC_ENG_SE_AES_0_IV_ENDIAN_POS    (3U)
#define SEC_ENG_SE_AES_0_IV_ENDIAN_LEN    (1U)
#define SEC_ENG_SE_AES_0_IV_ENDIAN_MSK    (((1U << SEC_ENG_SE_AES_0_IV_ENDIAN_LEN) - 1) << SEC_ENG_SE_AES_0_IV_ENDIAN_POS)
#define SEC_ENG_SE_AES_0_IV_ENDIAN_UMSK   (~(((1U << SEC_ENG_SE_AES_0_IV_ENDIAN_LEN) - 1) << SEC_ENG_SE_AES_0_IV_ENDIAN_POS))
#define SEC_ENG_SE_AES_0_TWK_ENDIAN       SEC_ENG_SE_AES_0_TWK_ENDIAN
#define SEC_ENG_SE_AES_0_TWK_ENDIAN_POS   (4U)
#define SEC_ENG_SE_AES_0_TWK_ENDIAN_LEN   (1U)
#define SEC_ENG_SE_AES_0_TWK_ENDIAN_MSK   (((1U << SEC_ENG_SE_AES_0_TWK_ENDIAN_LEN) - 1) << SEC_ENG_SE_AES_0_TWK_ENDIAN_POS)
#define SEC_ENG_SE_AES_0_TWK_ENDIAN_UMSK  (~(((1U << SEC_ENG_SE_AES_0_TWK_ENDIAN_LEN) - 1) << SEC_ENG_SE_AES_0_TWK_ENDIAN_POS))
#define SEC_ENG_SE_AES_0_CTR_LEN          SEC_ENG_SE_AES_0_CTR_LEN
#define SEC_ENG_SE_AES_0_CTR_LEN_POS      (30U)
#define SEC_ENG_SE_AES_0_CTR_LEN_LEN      (2U)
#define SEC_ENG_SE_AES_0_CTR_LEN_MSK      (((1U << SEC_ENG_SE_AES_0_CTR_LEN_LEN) - 1) << SEC_ENG_SE_AES_0_CTR_LEN_POS)
#define SEC_ENG_SE_AES_0_CTR_LEN_UMSK     (~(((1U << SEC_ENG_SE_AES_0_CTR_LEN_LEN) - 1) << SEC_ENG_SE_AES_0_CTR_LEN_POS))

/* 0x14C : se_aes_sboot */
// #define SEC_ENG_SE_AES_SBOOT_OFFSET                             (0x14C)
// #define SEC_ENG_SE_AES_SBOOT_KEY_SEL                            SEC_ENG_SE_AES_SBOOT_KEY_SEL
// #define SEC_ENG_SE_AES_SBOOT_KEY_SEL_POS                        (0U)
// #define SEC_ENG_SE_AES_SBOOT_KEY_SEL_LEN                        (1U)
// #define SEC_ENG_SE_AES_SBOOT_KEY_SEL_MSK                        (((1U<<SEC_ENG_SE_AES_SBOOT_KEY_SEL_LEN)-1)<<SEC_ENG_SE_AES_SBOOT_KEY_SEL_POS)
// #define SEC_ENG_SE_AES_SBOOT_KEY_SEL_UMSK                       (~(((1U<<SEC_ENG_SE_AES_SBOOT_KEY_SEL_LEN)-1)<<SEC_ENG_SE_AES_SBOOT_KEY_SEL_POS))
// #define SEC_ENG_SE_AES_0_XTS_MODE                               SEC_ENG_SE_AES_0_XTS_MODE
// #define SEC_ENG_SE_AES_0_XTS_MODE_POS                           (15U)
// #define SEC_ENG_SE_AES_0_XTS_MODE_LEN                           (1U)
// #define SEC_ENG_SE_AES_0_XTS_MODE_MSK                           (((1U<<SEC_ENG_SE_AES_0_XTS_MODE_LEN)-1)<<SEC_ENG_SE_AES_0_XTS_MODE_POS)
// #define SEC_ENG_SE_AES_0_XTS_MODE_UMSK                          (~(((1U<<SEC_ENG_SE_AES_0_XTS_MODE_LEN)-1)<<SEC_ENG_SE_AES_0_XTS_MODE_POS))
// #define SEC_ENG_SE_AES_0_UNI_LEN                                SEC_ENG_SE_AES_0_UNI_LEN
// #define SEC_ENG_SE_AES_0_UNI_LEN_POS                            (16U)
// #define SEC_ENG_SE_AES_0_UNI_LEN_LEN                            (16U)
// #define SEC_ENG_SE_AES_0_UNI_LEN_MSK                            (((1U<<SEC_ENG_SE_AES_0_UNI_LEN_LEN)-1)<<SEC_ENG_SE_AES_0_UNI_LEN_POS)
// #define SEC_ENG_SE_AES_0_UNI_LEN_UMSK                           (~(((1U<<SEC_ENG_SE_AES_0_UNI_LEN_LEN)-1)<<SEC_ENG_SE_AES_0_UNI_LEN_POS))

/* 0x150 : se_aes_0_link */
#define SEC_ENG_SE_AES_0_LINK_OFFSET (0x150)
#define SEC_ENG_SE_AES_0_LCA         SEC_ENG_SE_AES_0_LCA
#define SEC_ENG_SE_AES_0_LCA_POS     (0U)
#define SEC_ENG_SE_AES_0_LCA_LEN     (32U)
#define SEC_ENG_SE_AES_0_LCA_MSK     (((1U << SEC_ENG_SE_AES_0_LCA_LEN) - 1) << SEC_ENG_SE_AES_0_LCA_POS)
#define SEC_ENG_SE_AES_0_LCA_UMSK    (~(((1U << SEC_ENG_SE_AES_0_LCA_LEN) - 1) << SEC_ENG_SE_AES_0_LCA_POS))

/* 0x1FC : se_aes_0_ctrl_prot */
#define SEC_ENG_SE_AES_0_CTRL_PROT_OFFSET (0x1FC)
#define SEC_ENG_SE_AES_ID0_EN             SEC_ENG_SE_AES_ID0_EN
#define SEC_ENG_SE_AES_ID0_EN_POS         (1U)
#define SEC_ENG_SE_AES_ID0_EN_LEN         (1U)
#define SEC_ENG_SE_AES_ID0_EN_MSK         (((1U << SEC_ENG_SE_AES_ID0_EN_LEN) - 1) << SEC_ENG_SE_AES_ID0_EN_POS)
#define SEC_ENG_SE_AES_ID0_EN_UMSK        (~(((1U << SEC_ENG_SE_AES_ID0_EN_LEN) - 1) << SEC_ENG_SE_AES_ID0_EN_POS))
#define SEC_ENG_SE_AES_ID1_EN             SEC_ENG_SE_AES_ID1_EN
#define SEC_ENG_SE_AES_ID1_EN_POS         (2U)
#define SEC_ENG_SE_AES_ID1_EN_LEN         (1U)
#define SEC_ENG_SE_AES_ID1_EN_MSK         (((1U << SEC_ENG_SE_AES_ID1_EN_LEN) - 1) << SEC_ENG_SE_AES_ID1_EN_POS)
#define SEC_ENG_SE_AES_ID1_EN_UMSK        (~(((1U << SEC_ENG_SE_AES_ID1_EN_LEN) - 1) << SEC_ENG_SE_AES_ID1_EN_POS))

/* 0x200 : se_trng_0_ctrl_0 */
#define SEC_ENG_SE_TRNG_0_CTRL_0_OFFSET       (0x200)
#define SEC_ENG_SE_TRNG_0_BUSY                SEC_ENG_SE_TRNG_0_BUSY
#define SEC_ENG_SE_TRNG_0_BUSY_POS            (0U)
#define SEC_ENG_SE_TRNG_0_BUSY_LEN            (1U)
#define SEC_ENG_SE_TRNG_0_BUSY_MSK            (((1U << SEC_ENG_SE_TRNG_0_BUSY_LEN) - 1) << SEC_ENG_SE_TRNG_0_BUSY_POS)
#define SEC_ENG_SE_TRNG_0_BUSY_UMSK           (~(((1U << SEC_ENG_SE_TRNG_0_BUSY_LEN) - 1) << SEC_ENG_SE_TRNG_0_BUSY_POS))
#define SEC_ENG_SE_TRNG_0_TRIG_1T             SEC_ENG_SE_TRNG_0_TRIG_1T
#define SEC_ENG_SE_TRNG_0_TRIG_1T_POS         (1U)
#define SEC_ENG_SE_TRNG_0_TRIG_1T_LEN         (1U)
#define SEC_ENG_SE_TRNG_0_TRIG_1T_MSK         (((1U << SEC_ENG_SE_TRNG_0_TRIG_1T_LEN) - 1) << SEC_ENG_SE_TRNG_0_TRIG_1T_POS)
#define SEC_ENG_SE_TRNG_0_TRIG_1T_UMSK        (~(((1U << SEC_ENG_SE_TRNG_0_TRIG_1T_LEN) - 1) << SEC_ENG_SE_TRNG_0_TRIG_1T_POS))
#define SEC_ENG_SE_TRNG_0_EN                  SEC_ENG_SE_TRNG_0_EN
#define SEC_ENG_SE_TRNG_0_EN_POS              (2U)
#define SEC_ENG_SE_TRNG_0_EN_LEN              (1U)
#define SEC_ENG_SE_TRNG_0_EN_MSK              (((1U << SEC_ENG_SE_TRNG_0_EN_LEN) - 1) << SEC_ENG_SE_TRNG_0_EN_POS)
#define SEC_ENG_SE_TRNG_0_EN_UMSK             (~(((1U << SEC_ENG_SE_TRNG_0_EN_LEN) - 1) << SEC_ENG_SE_TRNG_0_EN_POS))
#define SEC_ENG_SE_TRNG_0_DOUT_CLR_1T         SEC_ENG_SE_TRNG_0_DOUT_CLR_1T
#define SEC_ENG_SE_TRNG_0_DOUT_CLR_1T_POS     (3U)
#define SEC_ENG_SE_TRNG_0_DOUT_CLR_1T_LEN     (1U)
#define SEC_ENG_SE_TRNG_0_DOUT_CLR_1T_MSK     (((1U << SEC_ENG_SE_TRNG_0_DOUT_CLR_1T_LEN) - 1) << SEC_ENG_SE_TRNG_0_DOUT_CLR_1T_POS)
#define SEC_ENG_SE_TRNG_0_DOUT_CLR_1T_UMSK    (~(((1U << SEC_ENG_SE_TRNG_0_DOUT_CLR_1T_LEN) - 1) << SEC_ENG_SE_TRNG_0_DOUT_CLR_1T_POS))
#define SEC_ENG_SE_TRNG_0_HT_ERROR            SEC_ENG_SE_TRNG_0_HT_ERROR
#define SEC_ENG_SE_TRNG_0_HT_ERROR_POS        (4U)
#define SEC_ENG_SE_TRNG_0_HT_ERROR_LEN        (1U)
#define SEC_ENG_SE_TRNG_0_HT_ERROR_MSK        (((1U << SEC_ENG_SE_TRNG_0_HT_ERROR_LEN) - 1) << SEC_ENG_SE_TRNG_0_HT_ERROR_POS)
#define SEC_ENG_SE_TRNG_0_HT_ERROR_UMSK       (~(((1U << SEC_ENG_SE_TRNG_0_HT_ERROR_LEN) - 1) << SEC_ENG_SE_TRNG_0_HT_ERROR_POS))
#define SEC_ENG_SE_TRNG_0_INT                 SEC_ENG_SE_TRNG_0_INT
#define SEC_ENG_SE_TRNG_0_INT_POS             (8U)
#define SEC_ENG_SE_TRNG_0_INT_LEN             (1U)
#define SEC_ENG_SE_TRNG_0_INT_MSK             (((1U << SEC_ENG_SE_TRNG_0_INT_LEN) - 1) << SEC_ENG_SE_TRNG_0_INT_POS)
#define SEC_ENG_SE_TRNG_0_INT_UMSK            (~(((1U << SEC_ENG_SE_TRNG_0_INT_LEN) - 1) << SEC_ENG_SE_TRNG_0_INT_POS))
#define SEC_ENG_SE_TRNG_0_INT_CLR_1T          SEC_ENG_SE_TRNG_0_INT_CLR_1T
#define SEC_ENG_SE_TRNG_0_INT_CLR_1T_POS      (9U)
#define SEC_ENG_SE_TRNG_0_INT_CLR_1T_LEN      (1U)
#define SEC_ENG_SE_TRNG_0_INT_CLR_1T_MSK      (((1U << SEC_ENG_SE_TRNG_0_INT_CLR_1T_LEN) - 1) << SEC_ENG_SE_TRNG_0_INT_CLR_1T_POS)
#define SEC_ENG_SE_TRNG_0_INT_CLR_1T_UMSK     (~(((1U << SEC_ENG_SE_TRNG_0_INT_CLR_1T_LEN) - 1) << SEC_ENG_SE_TRNG_0_INT_CLR_1T_POS))
#define SEC_ENG_SE_TRNG_0_INT_SET_1T          SEC_ENG_SE_TRNG_0_INT_SET_1T
#define SEC_ENG_SE_TRNG_0_INT_SET_1T_POS      (10U)
#define SEC_ENG_SE_TRNG_0_INT_SET_1T_LEN      (1U)
#define SEC_ENG_SE_TRNG_0_INT_SET_1T_MSK      (((1U << SEC_ENG_SE_TRNG_0_INT_SET_1T_LEN) - 1) << SEC_ENG_SE_TRNG_0_INT_SET_1T_POS)
#define SEC_ENG_SE_TRNG_0_INT_SET_1T_UMSK     (~(((1U << SEC_ENG_SE_TRNG_0_INT_SET_1T_LEN) - 1) << SEC_ENG_SE_TRNG_0_INT_SET_1T_POS))
#define SEC_ENG_SE_TRNG_0_INT_MASK            SEC_ENG_SE_TRNG_0_INT_MASK
#define SEC_ENG_SE_TRNG_0_INT_MASK_POS        (11U)
#define SEC_ENG_SE_TRNG_0_INT_MASK_LEN        (1U)
#define SEC_ENG_SE_TRNG_0_INT_MASK_MSK        (((1U << SEC_ENG_SE_TRNG_0_INT_MASK_LEN) - 1) << SEC_ENG_SE_TRNG_0_INT_MASK_POS)
#define SEC_ENG_SE_TRNG_0_INT_MASK_UMSK       (~(((1U << SEC_ENG_SE_TRNG_0_INT_MASK_LEN) - 1) << SEC_ENG_SE_TRNG_0_INT_MASK_POS))
#define SEC_ENG_SE_TRNG_0_MANUAL_FUN_SEL      SEC_ENG_SE_TRNG_0_MANUAL_FUN_SEL
#define SEC_ENG_SE_TRNG_0_MANUAL_FUN_SEL_POS  (13U)
#define SEC_ENG_SE_TRNG_0_MANUAL_FUN_SEL_LEN  (1U)
#define SEC_ENG_SE_TRNG_0_MANUAL_FUN_SEL_MSK  (((1U << SEC_ENG_SE_TRNG_0_MANUAL_FUN_SEL_LEN) - 1) << SEC_ENG_SE_TRNG_0_MANUAL_FUN_SEL_POS)
#define SEC_ENG_SE_TRNG_0_MANUAL_FUN_SEL_UMSK (~(((1U << SEC_ENG_SE_TRNG_0_MANUAL_FUN_SEL_LEN) - 1) << SEC_ENG_SE_TRNG_0_MANUAL_FUN_SEL_POS))
#define SEC_ENG_SE_TRNG_0_MANUAL_RESEED       SEC_ENG_SE_TRNG_0_MANUAL_RESEED
#define SEC_ENG_SE_TRNG_0_MANUAL_RESEED_POS   (14U)
#define SEC_ENG_SE_TRNG_0_MANUAL_RESEED_LEN   (1U)
#define SEC_ENG_SE_TRNG_0_MANUAL_RESEED_MSK   (((1U << SEC_ENG_SE_TRNG_0_MANUAL_RESEED_LEN) - 1) << SEC_ENG_SE_TRNG_0_MANUAL_RESEED_POS)
#define SEC_ENG_SE_TRNG_0_MANUAL_RESEED_UMSK  (~(((1U << SEC_ENG_SE_TRNG_0_MANUAL_RESEED_LEN) - 1) << SEC_ENG_SE_TRNG_0_MANUAL_RESEED_POS))
#define SEC_ENG_SE_TRNG_0_MANUAL_EN           SEC_ENG_SE_TRNG_0_MANUAL_EN
#define SEC_ENG_SE_TRNG_0_MANUAL_EN_POS       (15U)
#define SEC_ENG_SE_TRNG_0_MANUAL_EN_LEN       (1U)
#define SEC_ENG_SE_TRNG_0_MANUAL_EN_MSK       (((1U << SEC_ENG_SE_TRNG_0_MANUAL_EN_LEN) - 1) << SEC_ENG_SE_TRNG_0_MANUAL_EN_POS)
#define SEC_ENG_SE_TRNG_0_MANUAL_EN_UMSK      (~(((1U << SEC_ENG_SE_TRNG_0_MANUAL_EN_LEN) - 1) << SEC_ENG_SE_TRNG_0_MANUAL_EN_POS))

