bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/sec_eng_reg.h
/* 0x310 : se_pka_0_ctrl_1 */
#define SEC_ENG_SE_PKA_0_CTRL_1_OFFSET (0x310)
#define SEC_ENG_SE_PKA_0_HBURST        SEC_ENG_SE_PKA_0_HBURST
#define SEC_ENG_SE_PKA_0_HBURST_POS    (0U)
#define SEC_ENG_SE_PKA_0_HBURST_LEN    (3U)
#define SEC_ENG_SE_PKA_0_HBURST_MSK    (((1U << SEC_ENG_SE_PKA_0_HBURST_LEN) - 1) << SEC_ENG_SE_PKA_0_HBURST_POS)
#define SEC_ENG_SE_PKA_0_HBURST_UMSK   (~(((1U << SEC_ENG_SE_PKA_0_HBURST_LEN) - 1) << SEC_ENG_SE_PKA_0_HBURST_POS))
#define SEC_ENG_SE_PKA_0_HBYPASS       SEC_ENG_SE_PKA_0_HBYPASS
#define SEC_ENG_SE_PKA_0_HBYPASS_POS   (3U)
#define SEC_ENG_SE_PKA_0_HBYPASS_LEN   (1U)
#define SEC_ENG_SE_PKA_0_HBYPASS_MSK   (((1U << SEC_ENG_SE_PKA_0_HBYPASS_LEN) - 1) << SEC_ENG_SE_PKA_0_HBYPASS_POS)
#define SEC_ENG_SE_PKA_0_HBYPASS_UMSK  (~(((1U << SEC_ENG_SE_PKA_0_HBYPASS_LEN) - 1) << SEC_ENG_SE_PKA_0_HBYPASS_POS))
#define SEC_ENG_SE_PKA_0_LPW_EN        SEC_ENG_SE_PKA_0_LPW_EN
#define SEC_ENG_SE_PKA_0_LPW_EN_POS    (4U)
#define SEC_ENG_SE_PKA_0_LPW_EN_LEN    (1U)
#define SEC_ENG_SE_PKA_0_LPW_EN_MSK    (((1U << SEC_ENG_SE_PKA_0_LPW_EN_LEN) - 1) << SEC_ENG_SE_PKA_0_LPW_EN_POS)
#define SEC_ENG_SE_PKA_0_LPW_EN_UMSK   (~(((1U << SEC_ENG_SE_PKA_0_LPW_EN_LEN) - 1) << SEC_ENG_SE_PKA_0_LPW_EN_POS))
#define SEC_ENG_SE_PKA_0_BF_FMT        SEC_ENG_SE_PKA_0_BF_FMT
#define SEC_ENG_SE_PKA_0_BF_FMT_POS    (28U)
#define SEC_ENG_SE_PKA_0_BF_FMT_LEN    (3U)
#define SEC_ENG_SE_PKA_0_BF_FMT_MSK    (((1U << SEC_ENG_SE_PKA_0_BF_FMT_LEN) - 1) << SEC_ENG_SE_PKA_0_BF_FMT_POS)
#define SEC_ENG_SE_PKA_0_BF_FMT_UMSK   (~(((1U << SEC_ENG_SE_PKA_0_BF_FMT_LEN) - 1) << SEC_ENG_SE_PKA_0_BF_FMT_POS))
#define SEC_ENG_SE_PKA_0_25519_EN      SEC_ENG_SE_PKA_0_25519_EN
#define SEC_ENG_SE_PKA_0_25519_EN_POS  (31U)
#define SEC_ENG_SE_PKA_0_25519_EN_LEN  (1U)
#define SEC_ENG_SE_PKA_0_25519_EN_MSK  (((1U << SEC_ENG_SE_PKA_0_25519_EN_LEN) - 1) << SEC_ENG_SE_PKA_0_25519_EN_POS)
#define SEC_ENG_SE_PKA_0_25519_EN_UMSK (~(((1U << SEC_ENG_SE_PKA_0_25519_EN_LEN) - 1) << SEC_ENG_SE_PKA_0_25519_EN_POS))

/* 0x340 : se_pka_0_rw */
#define SEC_ENG_SE_PKA_0_RW_OFFSET (0x340)

/* 0x360 : se_pka_0_rw_burst */
#define SEC_ENG_SE_PKA_0_RW_BURST_OFFSET (0x360)

/* 0x3FC : se_pka_0_ctrl_prot */
#define SEC_ENG_SE_PKA_0_CTRL_PROT_OFFSET (0x3FC)
#define SEC_ENG_SE_PKA_ID0_EN             SEC_ENG_SE_PKA_ID0_EN
#define SEC_ENG_SE_PKA_ID0_EN_POS         (1U)
#define SEC_ENG_SE_PKA_ID0_EN_LEN         (1U)
#define SEC_ENG_SE_PKA_ID0_EN_MSK         (((1U << SEC_ENG_SE_PKA_ID0_EN_LEN) - 1) << SEC_ENG_SE_PKA_ID0_EN_POS)
#define SEC_ENG_SE_PKA_ID0_EN_UMSK        (~(((1U << SEC_ENG_SE_PKA_ID0_EN_LEN) - 1) << SEC_ENG_SE_PKA_ID0_EN_POS))
#define SEC_ENG_SE_PKA_ID1_EN             SEC_ENG_SE_PKA_ID1_EN
#define SEC_ENG_SE_PKA_ID1_EN_POS         (2U)
#define SEC_ENG_SE_PKA_ID1_EN_LEN         (1U)
#define SEC_ENG_SE_PKA_ID1_EN_MSK         (((1U << SEC_ENG_SE_PKA_ID1_EN_LEN) - 1) << SEC_ENG_SE_PKA_ID1_EN_POS)
#define SEC_ENG_SE_PKA_ID1_EN_UMSK        (~(((1U << SEC_ENG_SE_PKA_ID1_EN_LEN) - 1) << SEC_ENG_SE_PKA_ID1_EN_POS))

/* 0x400 : se_cdet_0_ctrl_0 */
#define SEC_ENG_SE_CDET_0_CTRL_0_OFFSET (0x400)
#define SEC_ENG_SE_CDET_0_EN            SEC_ENG_SE_CDET_0_EN
#define SEC_ENG_SE_CDET_0_EN_POS        (0U)
#define SEC_ENG_SE_CDET_0_EN_LEN        (1U)
#define SEC_ENG_SE_CDET_0_EN_MSK        (((1U << SEC_ENG_SE_CDET_0_EN_LEN) - 1) << SEC_ENG_SE_CDET_0_EN_POS)
#define SEC_ENG_SE_CDET_0_EN_UMSK       (~(((1U << SEC_ENG_SE_CDET_0_EN_LEN) - 1) << SEC_ENG_SE_CDET_0_EN_POS))
#define SEC_ENG_SE_CDET_0_BUSY          SEC_ENG_SE_CDET_0_BUSY
#define SEC_ENG_SE_CDET_0_BUSY_POS      (1U)
#define SEC_ENG_SE_CDET_0_BUSY_LEN      (1U)
#define SEC_ENG_SE_CDET_0_BUSY_MSK      (((1U << SEC_ENG_SE_CDET_0_BUSY_LEN) - 1) << SEC_ENG_SE_CDET_0_BUSY_POS)
#define SEC_ENG_SE_CDET_0_BUSY_UMSK     (~(((1U << SEC_ENG_SE_CDET_0_BUSY_LEN) - 1) << SEC_ENG_SE_CDET_0_BUSY_POS))
#define SEC_ENG_SE_CDET_0_STATUS        SEC_ENG_SE_CDET_0_STATUS
#define SEC_ENG_SE_CDET_0_STATUS_POS    (3U)
#define SEC_ENG_SE_CDET_0_STATUS_LEN    (5U)
#define SEC_ENG_SE_CDET_0_STATUS_MSK    (((1U << SEC_ENG_SE_CDET_0_STATUS_LEN) - 1) << SEC_ENG_SE_CDET_0_STATUS_POS)
#define SEC_ENG_SE_CDET_0_STATUS_UMSK   (~(((1U << SEC_ENG_SE_CDET_0_STATUS_LEN) - 1) << SEC_ENG_SE_CDET_0_STATUS_POS))
#define SEC_ENG_SE_CDET_0_INT           SEC_ENG_SE_CDET_0_INT
#define SEC_ENG_SE_CDET_0_INT_POS       (8U)
#define SEC_ENG_SE_CDET_0_INT_LEN       (1U)
#define SEC_ENG_SE_CDET_0_INT_MSK       (((1U << SEC_ENG_SE_CDET_0_INT_LEN) - 1) << SEC_ENG_SE_CDET_0_INT_POS)
#define SEC_ENG_SE_CDET_0_INT_UMSK      (~(((1U << SEC_ENG_SE_CDET_0_INT_LEN) - 1) << SEC_ENG_SE_CDET_0_INT_POS))
#define SEC_ENG_SE_CDET_0_INT_CLR       SEC_ENG_SE_CDET_0_INT_CLR
#define SEC_ENG_SE_CDET_0_INT_CLR_POS   (9U)
#define SEC_ENG_SE_CDET_0_INT_CLR_LEN   (1U)
#define SEC_ENG_SE_CDET_0_INT_CLR_MSK   (((1U << SEC_ENG_SE_CDET_0_INT_CLR_LEN) - 1) << SEC_ENG_SE_CDET_0_INT_CLR_POS)
#define SEC_ENG_SE_CDET_0_INT_CLR_UMSK  (~(((1U << SEC_ENG_SE_CDET_0_INT_CLR_LEN) - 1) << SEC_ENG_SE_CDET_0_INT_CLR_POS))
#define SEC_ENG_SE_CDET_0_INT_SET       SEC_ENG_SE_CDET_0_INT_SET
#define SEC_ENG_SE_CDET_0_INT_SET_POS   (10U)
#define SEC_ENG_SE_CDET_0_INT_SET_LEN   (1U)
#define SEC_ENG_SE_CDET_0_INT_SET_MSK   (((1U << SEC_ENG_SE_CDET_0_INT_SET_LEN) - 1) << SEC_ENG_SE_CDET_0_INT_SET_POS)
#define SEC_ENG_SE_CDET_0_INT_SET_UMSK  (~(((1U << SEC_ENG_SE_CDET_0_INT_SET_LEN) - 1) << SEC_ENG_SE_CDET_0_INT_SET_POS))
#define SEC_ENG_SE_CDET_0_INT_MASK      SEC_ENG_SE_CDET_0_INT_MASK
#define SEC_ENG_SE_CDET_0_INT_MASK_POS  (11U)
#define SEC_ENG_SE_CDET_0_INT_MASK_LEN  (1U)
#define SEC_ENG_SE_CDET_0_INT_MASK_MSK  (((1U << SEC_ENG_SE_CDET_0_INT_MASK_LEN) - 1) << SEC_ENG_SE_CDET_0_INT_MASK_POS)
#define SEC_ENG_SE_CDET_0_INT_MASK_UMSK (~(((1U << SEC_ENG_SE_CDET_0_INT_MASK_LEN) - 1) << SEC_ENG_SE_CDET_0_INT_MASK_POS))
#define SEC_ENG_SE_CDET_0_MODE          SEC_ENG_SE_CDET_0_MODE
#define SEC_ENG_SE_CDET_0_MODE_POS      (12U)
#define SEC_ENG_SE_CDET_0_MODE_LEN      (1U)
#define SEC_ENG_SE_CDET_0_MODE_MSK      (((1U << SEC_ENG_SE_CDET_0_MODE_LEN) - 1) << SEC_ENG_SE_CDET_0_MODE_POS)
#define SEC_ENG_SE_CDET_0_MODE_UMSK     (~(((1U << SEC_ENG_SE_CDET_0_MODE_LEN) - 1) << SEC_ENG_SE_CDET_0_MODE_POS))

/* 0x404 : se_cdet_0_ctrl_1 */
#define SEC_ENG_SE_CDET_0_CTRL_1_OFFSET   (0x404)
#define SEC_ENG_SE_CDET_0_G_LOOP_MAX      SEC_ENG_SE_CDET_0_G_LOOP_MAX
#define SEC_ENG_SE_CDET_0_G_LOOP_MAX_POS  (0U)
#define SEC_ENG_SE_CDET_0_G_LOOP_MAX_LEN  (16U)
#define SEC_ENG_SE_CDET_0_G_LOOP_MAX_MSK  (((1U << SEC_ENG_SE_CDET_0_G_LOOP_MAX_LEN) - 1) << SEC_ENG_SE_CDET_0_G_LOOP_MAX_POS)
#define SEC_ENG_SE_CDET_0_G_LOOP_MAX_UMSK (~(((1U << SEC_ENG_SE_CDET_0_G_LOOP_MAX_LEN) - 1) << SEC_ENG_SE_CDET_0_G_LOOP_MAX_POS))
#define SEC_ENG_SE_CDET_0_G_LOOP_MIN      SEC_ENG_SE_CDET_0_G_LOOP_MIN
#define SEC_ENG_SE_CDET_0_G_LOOP_MIN_POS  (16U)
#define SEC_ENG_SE_CDET_0_G_LOOP_MIN_LEN  (16U)
#define SEC_ENG_SE_CDET_0_G_LOOP_MIN_MSK  (((1U << SEC_ENG_SE_CDET_0_G_LOOP_MIN_LEN) - 1) << SEC_ENG_SE_CDET_0_G_LOOP_MIN_POS)
#define SEC_ENG_SE_CDET_0_G_LOOP_MIN_UMSK (~(((1U << SEC_ENG_SE_CDET_0_G_LOOP_MIN_LEN) - 1) << SEC_ENG_SE_CDET_0_G_LOOP_MIN_POS))

/* 0x408 : se_cdet_0_ctrl_2 */
#define SEC_ENG_SE_CDET_0_CTRL_2_OFFSET (0x408)
#define SEC_ENG_SE_CDET_0_T_LOOP_N      SEC_ENG_SE_CDET_0_T_LOOP_N
#define SEC_ENG_SE_CDET_0_T_LOOP_N_POS  (0U)
#define SEC_ENG_SE_CDET_0_T_LOOP_N_LEN  (16U)
#define SEC_ENG_SE_CDET_0_T_LOOP_N_MSK  (((1U << SEC_ENG_SE_CDET_0_T_LOOP_N_LEN) - 1) << SEC_ENG_SE_CDET_0_T_LOOP_N_POS)
#define SEC_ENG_SE_CDET_0_T_LOOP_N_UMSK (~(((1U << SEC_ENG_SE_CDET_0_T_LOOP_N_LEN) - 1) << SEC_ENG_SE_CDET_0_T_LOOP_N_POS))
#define SEC_ENG_SE_CDET_0_T_DLY_N       SEC_ENG_SE_CDET_0_T_DLY_N
#define SEC_ENG_SE_CDET_0_T_DLY_N_POS   (16U)
#define SEC_ENG_SE_CDET_0_T_DLY_N_LEN   (8U)
#define SEC_ENG_SE_CDET_0_T_DLY_N_MSK   (((1U << SEC_ENG_SE_CDET_0_T_DLY_N_LEN) - 1) << SEC_ENG_SE_CDET_0_T_DLY_N_POS)
#define SEC_ENG_SE_CDET_0_T_DLY_N_UMSK  (~(((1U << SEC_ENG_SE_CDET_0_T_DLY_N_LEN) - 1) << SEC_ENG_SE_CDET_0_T_DLY_N_POS))
#define SEC_ENG_SE_CDET_0_G_SLP_N       SEC_ENG_SE_CDET_0_G_SLP_N
#define SEC_ENG_SE_CDET_0_G_SLP_N_POS   (24U)
#define SEC_ENG_SE_CDET_0_G_SLP_N_LEN   (8U)
#define SEC_ENG_SE_CDET_0_G_SLP_N_MSK   (((1U << SEC_ENG_SE_CDET_0_G_SLP_N_LEN) - 1) << SEC_ENG_SE_CDET_0_G_SLP_N_POS)
#define SEC_ENG_SE_CDET_0_G_SLP_N_UMSK  (~(((1U << SEC_ENG_SE_CDET_0_G_SLP_N_LEN) - 1) << SEC_ENG_SE_CDET_0_G_SLP_N_POS))

/* 0x40C : se_cdet_0_ctrl_3 */
#define SEC_ENG_SE_CDET_0_CTRL_3_OFFSET (0x40C)
#define SEC_ENG_SE_CDET_0_T_COUNT       SEC_ENG_SE_CDET_0_T_COUNT
#define SEC_ENG_SE_CDET_0_T_COUNT_POS   (0U)
#define SEC_ENG_SE_CDET_0_T_COUNT_LEN   (16U)
#define SEC_ENG_SE_CDET_0_T_COUNT_MSK   (((1U << SEC_ENG_SE_CDET_0_T_COUNT_LEN) - 1) << SEC_ENG_SE_CDET_0_T_COUNT_POS)
#define SEC_ENG_SE_CDET_0_T_COUNT_UMSK  (~(((1U << SEC_ENG_SE_CDET_0_T_COUNT_LEN) - 1) << SEC_ENG_SE_CDET_0_T_COUNT_POS))
#define SEC_ENG_SE_CDET_0_G_COUNT       SEC_ENG_SE_CDET_0_G_COUNT
#define SEC_ENG_SE_CDET_0_G_COUNT_POS   (16U)
#define SEC_ENG_SE_CDET_0_G_COUNT_LEN   (16U)
#define SEC_ENG_SE_CDET_0_G_COUNT_MSK   (((1U << SEC_ENG_SE_CDET_0_G_COUNT_LEN) - 1) << SEC_ENG_SE_CDET_0_G_COUNT_POS)
#define SEC_ENG_SE_CDET_0_G_COUNT_UMSK  (~(((1U << SEC_ENG_SE_CDET_0_G_COUNT_LEN) - 1) << SEC_ENG_SE_CDET_0_G_COUNT_POS))

/* 0x4FC : se_cdet_0_ctrl_prot */
#define SEC_ENG_SE_CDET_0_CTRL_PROT_OFFSET (0x4FC)
#define SEC_ENG_SE_CDET_PROT_EN            SEC_ENG_SE_CDET_PROT_EN
#define SEC_ENG_SE_CDET_PROT_EN_POS        (0U)
#define SEC_ENG_SE_CDET_PROT_EN_LEN        (1U)
#define SEC_ENG_SE_CDET_PROT_EN_MSK        (((1U << SEC_ENG_SE_CDET_PROT_EN_LEN) - 1) << SEC_ENG_SE_CDET_PROT_EN_POS)
#define SEC_ENG_SE_CDET_PROT_EN_UMSK       (~(((1U << SEC_ENG_SE_CDET_PROT_EN_LEN) - 1) << SEC_ENG_SE_CDET_PROT_EN_POS))
#define SEC_ENG_SE_CDET_ID0_EN             SEC_ENG_SE_CDET_ID0_EN
#define SEC_ENG_SE_CDET_ID0_EN_POS         (1U)
#define SEC_ENG_SE_CDET_ID0_EN_LEN         (1U)
#define SEC_ENG_SE_CDET_ID0_EN_MSK         (((1U << SEC_ENG_SE_CDET_ID0_EN_LEN) - 1) << SEC_ENG_SE_CDET_ID0_EN_POS)
#define SEC_ENG_SE_CDET_ID0_EN_UMSK        (~(((1U << SEC_ENG_SE_CDET_ID0_EN_LEN) - 1) << SEC_ENG_SE_CDET_ID0_EN_POS))
#define SEC_ENG_SE_CDET_ID1_EN             SEC_ENG_SE_CDET_ID1_EN
#define SEC_ENG_SE_CDET_ID1_EN_POS         (2U)
#define SEC_ENG_SE_CDET_ID1_EN_LEN         (1U)
#define SEC_ENG_SE_CDET_ID1_EN_MSK         (((1U << SEC_ENG_SE_CDET_ID1_EN_LEN) - 1) << SEC_ENG_SE_CDET_ID1_EN_POS)
#define SEC_ENG_SE_CDET_ID1_EN_UMSK        (~(((1U << SEC_ENG_SE_CDET_ID1_EN_LEN) - 1) << SEC_ENG_SE_CDET_ID1_EN_POS))

/* 0x500 : se_gmac_0_ctrl_0 */
#define SEC_ENG_SE_GMAC_0_CTRL_0_OFFSET   (0x500)
#define SEC_ENG_SE_GMAC_0_BUSY            SEC_ENG_SE_GMAC_0_BUSY
#define SEC_ENG_SE_GMAC_0_BUSY_POS        (0U)
#define SEC_ENG_SE_GMAC_0_BUSY_LEN        (1U)
#define SEC_ENG_SE_GMAC_0_BUSY_MSK        (((1U << SEC_ENG_SE_GMAC_0_BUSY_LEN) - 1) << SEC_ENG_SE_GMAC_0_BUSY_POS)
#define SEC_ENG_SE_GMAC_0_BUSY_UMSK       (~(((1U << SEC_ENG_SE_GMAC_0_BUSY_LEN) - 1) << SEC_ENG_SE_GMAC_0_BUSY_POS))
#define SEC_ENG_SE_GMAC_0_TRIG_1T         SEC_ENG_SE_GMAC_0_TRIG_1T
#define SEC_ENG_SE_GMAC_0_TRIG_1T_POS     (1U)
#define SEC_ENG_SE_GMAC_0_TRIG_1T_LEN     (1U)
#define SEC_ENG_SE_GMAC_0_TRIG_1T_MSK     (((1U << SEC_ENG_SE_GMAC_0_TRIG_1T_LEN) - 1) << SEC_ENG_SE_GMAC_0_TRIG_1T_POS)
#define SEC_ENG_SE_GMAC_0_TRIG_1T_UMSK    (~(((1U << SEC_ENG_SE_GMAC_0_TRIG_1T_LEN) - 1) << SEC_ENG_SE_GMAC_0_TRIG_1T_POS))
#define SEC_ENG_SE_GMAC_0_EN              SEC_ENG_SE_GMAC_0_EN
#define SEC_ENG_SE_GMAC_0_EN_POS          (2U)
#define SEC_ENG_SE_GMAC_0_EN_LEN          (1U)
#define SEC_ENG_SE_GMAC_0_EN_MSK          (((1U << SEC_ENG_SE_GMAC_0_EN_LEN) - 1) << SEC_ENG_SE_GMAC_0_EN_POS)
#define SEC_ENG_SE_GMAC_0_EN_UMSK         (~(((1U << SEC_ENG_SE_GMAC_0_EN_LEN) - 1) << SEC_ENG_SE_GMAC_0_EN_POS))
#define SEC_ENG_SE_GMAC_0_INT             SEC_ENG_SE_GMAC_0_INT
#define SEC_ENG_SE_GMAC_0_INT_POS         (8U)
#define SEC_ENG_SE_GMAC_0_INT_LEN         (1U)
#define SEC_ENG_SE_GMAC_0_INT_MSK         (((1U << SEC_ENG_SE_GMAC_0_INT_LEN) - 1) << SEC_ENG_SE_GMAC_0_INT_POS)
#define SEC_ENG_SE_GMAC_0_INT_UMSK        (~(((1U << SEC_ENG_SE_GMAC_0_INT_LEN) - 1) << SEC_ENG_SE_GMAC_0_INT_POS))
#define SEC_ENG_SE_GMAC_0_INT_CLR_1T      SEC_ENG_SE_GMAC_0_INT_CLR_1T
#define SEC_ENG_SE_GMAC_0_INT_CLR_1T_POS  (9U)
#define SEC_ENG_SE_GMAC_0_INT_CLR_1T_LEN  (1U)
#define SEC_ENG_SE_GMAC_0_INT_CLR_1T_MSK  (((1U << SEC_ENG_SE_GMAC_0_INT_CLR_1T_LEN) - 1) << SEC_ENG_SE_GMAC_0_INT_CLR_1T_POS)
#define SEC_ENG_SE_GMAC_0_INT_CLR_1T_UMSK (~(((1U << SEC_ENG_SE_GMAC_0_INT_CLR_1T_LEN) - 1) << SEC_ENG_SE_GMAC_0_INT_CLR_1T_POS))
#define SEC_ENG_SE_GMAC_0_INT_SET_1T      SEC_ENG_SE_GMAC_0_INT_SET_1T
#define SEC_ENG_SE_GMAC_0_INT_SET_1T_POS  (10U)
#define SEC_ENG_SE_GMAC_0_INT_SET_1T_LEN  (1U)
#define SEC_ENG_SE_GMAC_0_INT_SET_1T_MSK  (((1U << SEC_ENG_SE_GMAC_0_INT_SET_1T_LEN) - 1) << SEC_ENG_SE_GMAC_0_INT_SET_1T_POS)
#define SEC_ENG_SE_GMAC_0_INT_SET_1T_UMSK (~(((1U << SEC_ENG_SE_GMAC_0_INT_SET_1T_LEN) - 1) << SEC_ENG_SE_GMAC_0_INT_SET_1T_POS))
#define SEC_ENG_SE_GMAC_0_INT_MASK        SEC_ENG_SE_GMAC_0_INT_MASK
#define SEC_ENG_SE_GMAC_0_INT_MASK_POS    (11U)
#define SEC_ENG_SE_GMAC_0_INT_MASK_LEN    (1U)
#define SEC_ENG_SE_GMAC_0_INT_MASK_MSK    (((1U << SEC_ENG_SE_GMAC_0_INT_MASK_LEN) - 1) << SEC_ENG_SE_GMAC_0_INT_MASK_POS)
#define SEC_ENG_SE_GMAC_0_INT_MASK_UMSK   (~(((1U << SEC_ENG_SE_GMAC_0_INT_MASK_LEN) - 1) << SEC_ENG_SE_GMAC_0_INT_MASK_POS))
#define SEC_ENG_SE_GMAC_0_T_ENDIAN        SEC_ENG_SE_GMAC_0_T_ENDIAN
#define SEC_ENG_SE_GMAC_0_T_ENDIAN_POS    (12U)
#define SEC_ENG_SE_GMAC_0_T_ENDIAN_LEN    (1U)
#define SEC_ENG_SE_GMAC_0_T_ENDIAN_MSK    (((1U << SEC_ENG_SE_GMAC_0_T_ENDIAN_LEN) - 1) << SEC_ENG_SE_GMAC_0_T_ENDIAN_POS)
#define SEC_ENG_SE_GMAC_0_T_ENDIAN_UMSK   (~(((1U << SEC_ENG_SE_GMAC_0_T_ENDIAN_LEN) - 1) << SEC_ENG_SE_GMAC_0_T_ENDIAN_POS))
#define SEC_ENG_SE_GMAC_0_H_ENDIAN        SEC_ENG_SE_GMAC_0_H_ENDIAN
#define SEC_ENG_SE_GMAC_0_H_ENDIAN_POS    (13U)
#define SEC_ENG_SE_GMAC_0_H_ENDIAN_LEN    (1U)
#define SEC_ENG_SE_GMAC_0_H_ENDIAN_MSK    (((1U << SEC_ENG_SE_GMAC_0_H_ENDIAN_LEN) - 1) << SEC_ENG_SE_GMAC_0_H_ENDIAN_POS)
#define SEC_ENG_SE_GMAC_0_H_ENDIAN_UMSK   (~(((1U << SEC_ENG_SE_GMAC_0_H_ENDIAN_LEN) - 1) << SEC_ENG_SE_GMAC_0_H_ENDIAN_POS))
#define SEC_ENG_SE_GMAC_0_X_ENDIAN        SEC_ENG_SE_GMAC_0_X_ENDIAN
#define SEC_ENG_SE_GMAC_0_X_ENDIAN_POS    (14U)
#define SEC_ENG_SE_GMAC_0_X_ENDIAN_LEN    (1U)
#define SEC_ENG_SE_GMAC_0_X_ENDIAN_MSK    (((1U << SEC_ENG_SE_GMAC_0_X_ENDIAN_LEN) - 1) << SEC_ENG_SE_GMAC_0_X_ENDIAN_POS)
#define SEC_ENG_SE_GMAC_0_X_ENDIAN_UMSK   (~(((1U << SEC_ENG_SE_GMAC_0_X_ENDIAN_LEN) - 1) << SEC_ENG_SE_GMAC_0_X_ENDIAN_POS))

/* 0x504 : se_gmac_0_lca */
#define SEC_ENG_SE_GMAC_0_LCA_OFFSET (0x504)
#define SEC_ENG_SE_GMAC_0_LCA        SEC_ENG_SE_GMAC_0_LCA
#define SEC_ENG_SE_GMAC_0_LCA_POS    (0U)
#define SEC_ENG_SE_GMAC_0_LCA_LEN    (32U)
#define SEC_ENG_SE_GMAC_0_LCA_MSK    (((1U << SEC_ENG_SE_GMAC_0_LCA_LEN) - 1) << SEC_ENG_SE_GMAC_0_LCA_POS)
#define SEC_ENG_SE_GMAC_0_LCA_UMSK   (~(((1U << SEC_ENG_SE_GMAC_0_LCA_LEN) - 1) << SEC_ENG_SE_GMAC_0_LCA_POS))

/* 0x508 : se_gmac_0_status */
#define SEC_ENG_SE_GMAC_0_STATUS_OFFSET (0x508)
#define SEC_ENG_SE_GMAC_0_STATUS        SEC_ENG_SE_GMAC_0_STATUS
#define SEC_ENG_SE_GMAC_0_STATUS_POS    (0U)
#define SEC_ENG_SE_GMAC_0_STATUS_LEN    (32U)
#define SEC_ENG_SE_GMAC_0_STATUS_MSK    (((1U << SEC_ENG_SE_GMAC_0_STATUS_LEN) - 1) << SEC_ENG_SE_GMAC_0_STATUS_POS)
#define SEC_ENG_SE_GMAC_0_STATUS_UMSK   (~(((1U << SEC_ENG_SE_GMAC_0_STATUS_LEN) - 1) << SEC_ENG_SE_GMAC_0_STATUS_POS))

