bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/sec_eng_reg.h
    /* 0x4 : se_sha_0_msa */
    union {
        struct {
            uint32_t se_sha_0_msa : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } se_sha_0_msa;

    /* 0x8 : se_sha_0_status */
    union {
        struct {
            uint32_t se_sha_0_status : 32; /* [31: 0],          r,       0x41 */
        } BF;
        uint32_t WORD;
    } se_sha_0_status;

    /* 0xC : se_sha_0_endian */
    union {
        struct {
            uint32_t se_sha_0_dout_endian : 1;  /* [    0],        r/w,        0x1 */
            uint32_t reserved_1_31        : 31; /* [31: 1],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } se_sha_0_endian;

    /* 0x10 : se_sha_0_hash_l_0 */
    union {
        struct {
            uint32_t se_sha_0_hash_l_0 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_sha_0_hash_l_0;

    /* 0x14 : se_sha_0_hash_l_1 */
    union {
        struct {
            uint32_t se_sha_0_hash_l_1 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_sha_0_hash_l_1;

    /* 0x18 : se_sha_0_hash_l_2 */
    union {
        struct {
            uint32_t se_sha_0_hash_l_2 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_sha_0_hash_l_2;

    /* 0x1C : se_sha_0_hash_l_3 */
    union {
        struct {
            uint32_t se_sha_0_hash_l_3 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_sha_0_hash_l_3;

    /* 0x20 : se_sha_0_hash_l_4 */
    union {
        struct {
            uint32_t se_sha_0_hash_l_4 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_sha_0_hash_l_4;

    /* 0x24 : se_sha_0_hash_l_5 */
    union {
        struct {
            uint32_t se_sha_0_hash_l_5 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_sha_0_hash_l_5;

    /* 0x28 : se_sha_0_hash_l_6 */
    union {
        struct {
            uint32_t se_sha_0_hash_l_6 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_sha_0_hash_l_6;

    /* 0x2C : se_sha_0_hash_l_7 */
    union {
        struct {
            uint32_t se_sha_0_hash_l_7 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_sha_0_hash_l_7;

    /* 0x30 : se_sha_0_hash_h_0 */
    union {
        struct {
            uint32_t se_sha_0_hash_h_0 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_sha_0_hash_h_0;

    /* 0x34 : se_sha_0_hash_h_1 */
    union {
        struct {
            uint32_t se_sha_0_hash_h_1 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_sha_0_hash_h_1;

    /* 0x38 : se_sha_0_hash_h_2 */
    union {
        struct {
            uint32_t se_sha_0_hash_h_2 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_sha_0_hash_h_2;

    /* 0x3C : se_sha_0_hash_h_3 */
    union {
        struct {
            uint32_t se_sha_0_hash_h_3 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_sha_0_hash_h_3;

    /* 0x40 : se_sha_0_hash_h_4 */
    union {
        struct {
            uint32_t se_sha_0_hash_h_4 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_sha_0_hash_h_4;

    /* 0x44 : se_sha_0_hash_h_5 */
    union {
        struct {
            uint32_t se_sha_0_hash_h_5 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_sha_0_hash_h_5;

    /* 0x48 : se_sha_0_hash_h_6 */
    union {
        struct {
            uint32_t se_sha_0_hash_h_6 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_sha_0_hash_h_6;

    /* 0x4C : se_sha_0_hash_h_7 */
    union {
        struct {
            uint32_t se_sha_0_hash_h_7 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_sha_0_hash_h_7;

    /* 0x50 : se_sha_0_link */
    union {
        struct {
            uint32_t se_sha_0_lca : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } se_sha_0_link;

    /* 0x54  reserved */
    uint8_t RESERVED0x54[168];

    /* 0xFC : se_sha_0_ctrl_prot */
    union {
        struct {
            uint32_t reserved_0    : 1;  /* [    0],       rsvd,        0x0 */
            uint32_t se_sha_id0_en : 1;  /* [    1],        r/w,        0x1 */
            uint32_t se_sha_id1_en : 1;  /* [    2],        r/w,        0x1 */
            uint32_t reserved_3_31 : 29; /* [31: 3],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } se_sha_0_ctrl_prot;

    /* 0x100 : se_aes_0_ctrl */
    union {
        struct {
            uint32_t se_aes_0_busy        : 1;  /* [    0],          r,        0x0 */
            uint32_t se_aes_0_trig_1t     : 1;  /* [    1],        w1p,        0x0 */
            uint32_t se_aes_0_en          : 1;  /* [    2],        r/w,        0x1 */
            uint32_t se_aes_0_mode        : 2;  /* [ 4: 3],        r/w,        0x0 */
            uint32_t se_aes_0_dec_en      : 1;  /* [    5],        r/w,        0x0 */
            uint32_t se_aes_0_dec_key_sel : 1;  /* [    6],        r/w,        0x0 */
            uint32_t se_aes_0_hw_key_en   : 1;  /* [    7],        r/w,        0x0 */
            uint32_t se_aes_0_int         : 1;  /* [    8],          r,        0x0 */
            uint32_t se_aes_0_int_clr_1t  : 1;  /* [    9],        w1p,        0x0 */
            uint32_t se_aes_0_int_set_1t  : 1;  /* [   10],        w1p,        0x0 */
            uint32_t se_aes_0_int_mask    : 1;  /* [   11],        r/w,        0x0 */
            uint32_t se_aes_0_block_mode  : 2;  /* [13:12],        r/w,        0x0 */
            uint32_t se_aes_0_iv_sel      : 1;  /* [   14],        r/w,        0x0 */
            uint32_t se_aes_0_link_mode   : 1;  /* [   15],        r/w,        0x0 */
            uint32_t se_aes_0_msg_len     : 16; /* [31:16],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } se_aes_0_ctrl;

