bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/sec_eng_reg.h
    /* 0x204 : se_trng_0_status */
    union {
        struct {
            uint32_t se_trng_0_status : 32; /* [31: 0],          r,   0x100020 */
        } BF;
        uint32_t WORD;
    } se_trng_0_status;

    /* 0x208 : se_trng_0_dout_0 */
    union {
        struct {
            uint32_t se_trng_0_dout_0 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_trng_0_dout_0;

    /* 0x20C : se_trng_0_dout_1 */
    union {
        struct {
            uint32_t se_trng_0_dout_1 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_trng_0_dout_1;

    /* 0x210 : se_trng_0_dout_2 */
    union {
        struct {
            uint32_t se_trng_0_dout_2 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_trng_0_dout_2;

    /* 0x214 : se_trng_0_dout_3 */
    union {
        struct {
            uint32_t se_trng_0_dout_3 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_trng_0_dout_3;

    /* 0x218 : se_trng_0_dout_4 */
    union {
        struct {
            uint32_t se_trng_0_dout_4 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_trng_0_dout_4;

    /* 0x21C : se_trng_0_dout_5 */
    union {
        struct {
            uint32_t se_trng_0_dout_5 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_trng_0_dout_5;

    /* 0x220 : se_trng_0_dout_6 */
    union {
        struct {
            uint32_t se_trng_0_dout_6 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_trng_0_dout_6;

    /* 0x224 : se_trng_0_dout_7 */
    union {
        struct {
            uint32_t se_trng_0_dout_7 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_trng_0_dout_7;

    /* 0x228 : se_trng_0_test */
    union {
        struct {
            uint32_t se_trng_0_test_en    : 1;  /* [    0],        r/w,        0x0 */
            uint32_t se_trng_0_cp_test_en : 1;  /* [    1],        r/w,        0x0 */
            uint32_t se_trng_0_cp_bypass  : 1;  /* [    2],        r/w,        0x0 */
            uint32_t se_trng_0_ht_dis     : 1;  /* [    3],        r/w,        0x0 */
            uint32_t se_trng_0_ht_alarm_n : 8;  /* [11: 4],        r/w,        0x0 */
            uint32_t reserved_12_31       : 20; /* [31:12],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } se_trng_0_test;

    /* 0x22C : se_trng_0_ctrl_1 */
    union {
        struct {
            uint32_t se_trng_0_reseed_n_lsb : 32; /* [31: 0],        r/w,     0xffff */
        } BF;
        uint32_t WORD;
    } se_trng_0_ctrl_1;

    /* 0x230 : se_trng_0_ctrl_2 */
    union {
        struct {
            uint32_t se_trng_0_reseed_n_msb : 16; /* [15: 0],        r/w,       0xff */
            uint32_t reserved_16_31         : 16; /* [31:16],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } se_trng_0_ctrl_2;

    /* 0x234 : se_trng_0_ctrl_3 */
    union {
        struct {
            uint32_t se_trng_0_cp_ratio : 8;  /* [ 7: 0],        r/w,        0x3 */
            uint32_t se_trng_0_ht_rct_c : 8;  /* [15: 8],        r/w,       0x42 */
            uint32_t se_trng_0_ht_apt_c : 10; /* [25:16],        r/w,      0x37a */
            uint32_t se_trng_0_ht_od_en : 1;  /* [   26],        r/w,        0x0 */
            uint32_t reserved_27_30     : 4;  /* [30:27],       rsvd,        0x0 */
            uint32_t se_trng_0_rosc_en  : 1;  /* [   31],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } se_trng_0_ctrl_3;

    /* 0x238  reserved */
    uint8_t RESERVED0x238[8];

    /* 0x240 : se_trng_0_test_out_0 */
    union {
        struct {
            uint32_t se_trng_0_test_out_0 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_trng_0_test_out_0;

    /* 0x244 : se_trng_0_test_out_1 */
    union {
        struct {
            uint32_t se_trng_0_test_out_1 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_trng_0_test_out_1;

    /* 0x248 : se_trng_0_test_out_2 */
    union {
        struct {
            uint32_t se_trng_0_test_out_2 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_trng_0_test_out_2;

    /* 0x24C : se_trng_0_test_out_3 */
    union {
        struct {
            uint32_t se_trng_0_test_out_3 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_trng_0_test_out_3;

    /* 0x250  reserved */
    uint8_t RESERVED0x250[172];

    /* 0x2FC : se_trng_0_ctrl_prot */
    union {
        struct {
            uint32_t reserved_0     : 1;  /* [    0],       rsvd,        0x0 */
            uint32_t se_trng_id0_en : 1;  /* [    1],        r/w,        0x1 */
            uint32_t se_trng_id1_en : 1;  /* [    2],        r/w,        0x1 */
            uint32_t reserved_3_31  : 29; /* [31: 3],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } se_trng_0_ctrl_prot;

    /* 0x300 : se_pka_0_ctrl_0 */
    union {
        struct {
            uint32_t se_pka_0_done          : 1;  /* [    0],          r,        0x0 */
            uint32_t se_pka_0_done_clr_1t   : 1;  /* [    1],        w1p,        0x0 */
            uint32_t se_pka_0_busy          : 1;  /* [    2],          r,        0x0 */
            uint32_t se_pka_0_en            : 1;  /* [    3],        r/w,        0x1 */
            uint32_t se_pka_0_prot_md       : 4;  /* [ 7: 4],        r/w,        0x0 */
            uint32_t se_pka_0_int           : 1;  /* [    8],          r,        0x0 */
            uint32_t se_pka_0_int_clr_1t    : 1;  /* [    9],        w1p,        0x0 */
            uint32_t se_pka_0_int_set       : 1;  /* [   10],        r/w,        0x0 */
            uint32_t se_pka_0_int_mask      : 1;  /* [   11],        r/w,        0x0 */
            uint32_t se_pka_0_endian        : 1;  /* [   12],        r/w,        0x0 */
            uint32_t se_pka_0_ram_clr_md    : 1;  /* [   13],        r/w,        0x0 */
            uint32_t se_pka_0_status_equ    : 1;  /* [   14],          r,        0x0 */
            uint32_t se_pka_0_status_clr_1t : 1;  /* [   15],        w1p,        0x0 */
            uint32_t se_pka_0_status        : 16; /* [31:16],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_pka_0_ctrl_0;

