bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/sec_eng_reg.h
/* 0x18 : se_sha_hash_l_2 */
#define SEC_ENG_SE_SHA_HASH_L_2_OFFSET (0x18)
#define SEC_ENG_SE_SHA_HASH_L_2        SEC_ENG_SE_SHA_HASH_L_2
#define SEC_ENG_SE_SHA_HASH_L_2_POS    (0U)
#define SEC_ENG_SE_SHA_HASH_L_2_LEN    (32U)
#define SEC_ENG_SE_SHA_HASH_L_2_MSK    (((1U << SEC_ENG_SE_SHA_HASH_L_2_LEN) - 1) << SEC_ENG_SE_SHA_HASH_L_2_POS)
#define SEC_ENG_SE_SHA_HASH_L_2_UMSK   (~(((1U << SEC_ENG_SE_SHA_HASH_L_2_LEN) - 1) << SEC_ENG_SE_SHA_HASH_L_2_POS))

/* 0x1c : se_sha_hash_l_3 */
#define SEC_ENG_SE_SHA_HASH_L_3_OFFSET (0x1c)
#define SEC_ENG_SE_SHA_HASH_L_3        SEC_ENG_SE_SHA_HASH_L_3
#define SEC_ENG_SE_SHA_HASH_L_3_POS    (0U)
#define SEC_ENG_SE_SHA_HASH_L_3_LEN    (32U)
#define SEC_ENG_SE_SHA_HASH_L_3_MSK    (((1U << SEC_ENG_SE_SHA_HASH_L_3_LEN) - 1) << SEC_ENG_SE_SHA_HASH_L_3_POS)
#define SEC_ENG_SE_SHA_HASH_L_3_UMSK   (~(((1U << SEC_ENG_SE_SHA_HASH_L_3_LEN) - 1) << SEC_ENG_SE_SHA_HASH_L_3_POS))

/* 0x20 : se_sha_hash_l_4 */
#define SEC_ENG_SE_SHA_HASH_L_4_OFFSET (0x20)
#define SEC_ENG_SE_SHA_HASH_L_4        SEC_ENG_SE_SHA_HASH_L_4
#define SEC_ENG_SE_SHA_HASH_L_4_POS    (0U)
#define SEC_ENG_SE_SHA_HASH_L_4_LEN    (32U)
#define SEC_ENG_SE_SHA_HASH_L_4_MSK    (((1U << SEC_ENG_SE_SHA_HASH_L_4_LEN) - 1) << SEC_ENG_SE_SHA_HASH_L_4_POS)
#define SEC_ENG_SE_SHA_HASH_L_4_UMSK   (~(((1U << SEC_ENG_SE_SHA_HASH_L_4_LEN) - 1) << SEC_ENG_SE_SHA_HASH_L_4_POS))

/* 0x24 : se_sha_hash_l_5 */
#define SEC_ENG_SE_SHA_HASH_L_5_OFFSET (0x24)
#define SEC_ENG_SE_SHA_HASH_L_5        SEC_ENG_SE_SHA_HASH_L_5
#define SEC_ENG_SE_SHA_HASH_L_5_POS    (0U)
#define SEC_ENG_SE_SHA_HASH_L_5_LEN    (32U)
#define SEC_ENG_SE_SHA_HASH_L_5_MSK    (((1U << SEC_ENG_SE_SHA_HASH_L_5_LEN) - 1) << SEC_ENG_SE_SHA_HASH_L_5_POS)
#define SEC_ENG_SE_SHA_HASH_L_5_UMSK   (~(((1U << SEC_ENG_SE_SHA_HASH_L_5_LEN) - 1) << SEC_ENG_SE_SHA_HASH_L_5_POS))

/* 0x28 : se_sha_hash_l_6 */
#define SEC_ENG_SE_SHA_HASH_L_6_OFFSET (0x28)
#define SEC_ENG_SE_SHA_HASH_L_6        SEC_ENG_SE_SHA_HASH_L_6
#define SEC_ENG_SE_SHA_HASH_L_6_POS    (0U)
#define SEC_ENG_SE_SHA_HASH_L_6_LEN    (32U)
#define SEC_ENG_SE_SHA_HASH_L_6_MSK    (((1U << SEC_ENG_SE_SHA_HASH_L_6_LEN) - 1) << SEC_ENG_SE_SHA_HASH_L_6_POS)
#define SEC_ENG_SE_SHA_HASH_L_6_UMSK   (~(((1U << SEC_ENG_SE_SHA_HASH_L_6_LEN) - 1) << SEC_ENG_SE_SHA_HASH_L_6_POS))

/* 0x2c : se_sha_hash_l_7 */
#define SEC_ENG_SE_SHA_HASH_L_7_OFFSET (0x2c)
#define SEC_ENG_SE_SHA_HASH_L_7        SEC_ENG_SE_SHA_HASH_L_7
#define SEC_ENG_SE_SHA_HASH_L_7_POS    (0U)
#define SEC_ENG_SE_SHA_HASH_L_7_LEN    (32U)
#define SEC_ENG_SE_SHA_HASH_L_7_MSK    (((1U << SEC_ENG_SE_SHA_HASH_L_7_LEN) - 1) << SEC_ENG_SE_SHA_HASH_L_7_POS)
#define SEC_ENG_SE_SHA_HASH_L_7_UMSK   (~(((1U << SEC_ENG_SE_SHA_HASH_L_7_LEN) - 1) << SEC_ENG_SE_SHA_HASH_L_7_POS))

/* 0x30 : se_sha_hash_h_0 */
#define SEC_ENG_SE_SHA_HASH_H_0_OFFSET (0x30)
#define SEC_ENG_SE_SHA_HASH_H_0        SEC_ENG_SE_SHA_HASH_H_0
#define SEC_ENG_SE_SHA_HASH_H_0_POS    (0U)
#define SEC_ENG_SE_SHA_HASH_H_0_LEN    (32U)
#define SEC_ENG_SE_SHA_HASH_H_0_MSK    (((1U << SEC_ENG_SE_SHA_HASH_H_0_LEN) - 1) << SEC_ENG_SE_SHA_HASH_H_0_POS)
#define SEC_ENG_SE_SHA_HASH_H_0_UMSK   (~(((1U << SEC_ENG_SE_SHA_HASH_H_0_LEN) - 1) << SEC_ENG_SE_SHA_HASH_H_0_POS))

/* 0x34 : se_sha_hash_h_1 */
#define SEC_ENG_SE_SHA_HASH_H_1_OFFSET (0x34)
#define SEC_ENG_SE_SHA_HASH_H_1        SEC_ENG_SE_SHA_HASH_H_1
#define SEC_ENG_SE_SHA_HASH_H_1_POS    (0U)
#define SEC_ENG_SE_SHA_HASH_H_1_LEN    (32U)
#define SEC_ENG_SE_SHA_HASH_H_1_MSK    (((1U << SEC_ENG_SE_SHA_HASH_H_1_LEN) - 1) << SEC_ENG_SE_SHA_HASH_H_1_POS)
#define SEC_ENG_SE_SHA_HASH_H_1_UMSK   (~(((1U << SEC_ENG_SE_SHA_HASH_H_1_LEN) - 1) << SEC_ENG_SE_SHA_HASH_H_1_POS))

/* 0x38 : se_sha_hash_h_2 */
#define SEC_ENG_SE_SHA_HASH_H_2_OFFSET (0x38)
#define SEC_ENG_SE_SHA_HASH_H_2        SEC_ENG_SE_SHA_HASH_H_2
#define SEC_ENG_SE_SHA_HASH_H_2_POS    (0U)
#define SEC_ENG_SE_SHA_HASH_H_2_LEN    (32U)
#define SEC_ENG_SE_SHA_HASH_H_2_MSK    (((1U << SEC_ENG_SE_SHA_HASH_H_2_LEN) - 1) << SEC_ENG_SE_SHA_HASH_H_2_POS)
#define SEC_ENG_SE_SHA_HASH_H_2_UMSK   (~(((1U << SEC_ENG_SE_SHA_HASH_H_2_LEN) - 1) << SEC_ENG_SE_SHA_HASH_H_2_POS))

/* 0x3c : se_sha_hash_h_3 */
#define SEC_ENG_SE_SHA_HASH_H_3_OFFSET (0x3c)
#define SEC_ENG_SE_SHA_HASH_H_3        SEC_ENG_SE_SHA_HASH_H_3
#define SEC_ENG_SE_SHA_HASH_H_3_POS    (0U)
#define SEC_ENG_SE_SHA_HASH_H_3_LEN    (32U)
#define SEC_ENG_SE_SHA_HASH_H_3_MSK    (((1U << SEC_ENG_SE_SHA_HASH_H_3_LEN) - 1) << SEC_ENG_SE_SHA_HASH_H_3_POS)
#define SEC_ENG_SE_SHA_HASH_H_3_UMSK   (~(((1U << SEC_ENG_SE_SHA_HASH_H_3_LEN) - 1) << SEC_ENG_SE_SHA_HASH_H_3_POS))

/* 0x40 : se_sha_hash_h_4 */
#define SEC_ENG_SE_SHA_HASH_H_4_OFFSET (0x40)
#define SEC_ENG_SE_SHA_HASH_H_4        SEC_ENG_SE_SHA_HASH_H_4
#define SEC_ENG_SE_SHA_HASH_H_4_POS    (0U)
#define SEC_ENG_SE_SHA_HASH_H_4_LEN    (32U)
#define SEC_ENG_SE_SHA_HASH_H_4_MSK    (((1U << SEC_ENG_SE_SHA_HASH_H_4_LEN) - 1) << SEC_ENG_SE_SHA_HASH_H_4_POS)
#define SEC_ENG_SE_SHA_HASH_H_4_UMSK   (~(((1U << SEC_ENG_SE_SHA_HASH_H_4_LEN) - 1) << SEC_ENG_SE_SHA_HASH_H_4_POS))

/* 0x44 : se_sha_hash_h_5 */
#define SEC_ENG_SE_SHA_HASH_H_5_OFFSET (0x44)
#define SEC_ENG_SE_SHA_HASH_H_5        SEC_ENG_SE_SHA_HASH_H_5
#define SEC_ENG_SE_SHA_HASH_H_5_POS    (0U)
#define SEC_ENG_SE_SHA_HASH_H_5_LEN    (32U)
#define SEC_ENG_SE_SHA_HASH_H_5_MSK    (((1U << SEC_ENG_SE_SHA_HASH_H_5_LEN) - 1) << SEC_ENG_SE_SHA_HASH_H_5_POS)
#define SEC_ENG_SE_SHA_HASH_H_5_UMSK   (~(((1U << SEC_ENG_SE_SHA_HASH_H_5_LEN) - 1) << SEC_ENG_SE_SHA_HASH_H_5_POS))

/* 0x48 : se_sha_hash_h_6 */
#define SEC_ENG_SE_SHA_HASH_H_6_OFFSET (0x48)
#define SEC_ENG_SE_SHA_HASH_H_6        SEC_ENG_SE_SHA_HASH_H_6
#define SEC_ENG_SE_SHA_HASH_H_6_POS    (0U)
#define SEC_ENG_SE_SHA_HASH_H_6_LEN    (32U)
#define SEC_ENG_SE_SHA_HASH_H_6_MSK    (((1U << SEC_ENG_SE_SHA_HASH_H_6_LEN) - 1) << SEC_ENG_SE_SHA_HASH_H_6_POS)
#define SEC_ENG_SE_SHA_HASH_H_6_UMSK   (~(((1U << SEC_ENG_SE_SHA_HASH_H_6_LEN) - 1) << SEC_ENG_SE_SHA_HASH_H_6_POS))

/* 0x4c : se_sha_hash_h_7 */
#define SEC_ENG_SE_SHA_HASH_H_7_OFFSET (0x4c)
#define SEC_ENG_SE_SHA_HASH_H_7        SEC_ENG_SE_SHA_HASH_H_7
#define SEC_ENG_SE_SHA_HASH_H_7_POS    (0U)
#define SEC_ENG_SE_SHA_HASH_H_7_LEN    (32U)
#define SEC_ENG_SE_SHA_HASH_H_7_MSK    (((1U << SEC_ENG_SE_SHA_HASH_H_7_LEN) - 1) << SEC_ENG_SE_SHA_HASH_H_7_POS)
#define SEC_ENG_SE_SHA_HASH_H_7_UMSK   (~(((1U << SEC_ENG_SE_SHA_HASH_H_7_LEN) - 1) << SEC_ENG_SE_SHA_HASH_H_7_POS))

/* 0x50 : se_sha_link */
#define SEC_ENG_SE_SHA_LINK_OFFSET (0x50)
#define SEC_ENG_SE_SHA_LCA         SEC_ENG_SE_SHA_LCA
#define SEC_ENG_SE_SHA_LCA_POS     (0U)
#define SEC_ENG_SE_SHA_LCA_LEN     (32U)
#define SEC_ENG_SE_SHA_LCA_MSK     (((1U << SEC_ENG_SE_SHA_LCA_LEN) - 1) << SEC_ENG_SE_SHA_LCA_POS)
#define SEC_ENG_SE_SHA_LCA_UMSK    (~(((1U << SEC_ENG_SE_SHA_LCA_LEN) - 1) << SEC_ENG_SE_SHA_LCA_POS))

/* 0xfc : se_sha_ctrl_prot */
#define SEC_ENG_SE_SHA_CTRL_PROT_OFFSET (0xfc)
#define SEC_ENG_SE_SHA_ID0_EN           SEC_ENG_SE_SHA_ID0_EN
#define SEC_ENG_SE_SHA_ID0_EN_POS       (1U)
#define SEC_ENG_SE_SHA_ID0_EN_LEN       (1U)
#define SEC_ENG_SE_SHA_ID0_EN_MSK       (((1U << SEC_ENG_SE_SHA_ID0_EN_LEN) - 1) << SEC_ENG_SE_SHA_ID0_EN_POS)
#define SEC_ENG_SE_SHA_ID0_EN_UMSK      (~(((1U << SEC_ENG_SE_SHA_ID0_EN_LEN) - 1) << SEC_ENG_SE_SHA_ID0_EN_POS))
#define SEC_ENG_SE_SHA_ID1_EN           SEC_ENG_SE_SHA_ID1_EN
#define SEC_ENG_SE_SHA_ID1_EN_POS       (2U)
#define SEC_ENG_SE_SHA_ID1_EN_LEN       (1U)
#define SEC_ENG_SE_SHA_ID1_EN_MSK       (((1U << SEC_ENG_SE_SHA_ID1_EN_LEN) - 1) << SEC_ENG_SE_SHA_ID1_EN_POS)
#define SEC_ENG_SE_SHA_ID1_EN_UMSK      (~(((1U << SEC_ENG_SE_SHA_ID1_EN_LEN) - 1) << SEC_ENG_SE_SHA_ID1_EN_POS))

struct sec_eng_sha_reg {
    /* 0x0 : se_sha_ctrl */
    union {
        struct {
            uint32_t se_sha_busy       : 1;  /* [    0],          r,        0x0 */
            uint32_t se_sha_trig_1t    : 1;  /* [    1],        w1p,        0x0 */
            uint32_t se_sha_mode       : 3;  /* [ 4: 2],        r/w,        0x0 */
            uint32_t se_sha_en         : 1;  /* [    5],        r/w,        0x1 */
            uint32_t se_sha_hash_sel   : 1;  /* [    6],        r/w,        0x0 */
            uint32_t reserved_7        : 1;  /* [    7],       rsvd,        0x0 */
            uint32_t se_sha_int        : 1;  /* [    8],          r,        0x0 */
            uint32_t se_sha_int_clr_1t : 1;  /* [    9],        w1p,        0x0 */
            uint32_t se_sha_int_set_1t : 1;  /* [   10],        w1p,        0x0 */
            uint32_t se_sha_int_mask   : 1;  /* [   11],        r/w,        0x0 */
            uint32_t se_sha_mode_ext   : 2;  /* [13:12],        r/w,        0x0 */
            uint32_t reserved_14       : 1;  /* [   14],       rsvd,        0x0 */
            uint32_t se_sha_link_mode  : 1;  /* [   15],        r/w,        0x0 */
            uint32_t se_sha_msg_len    : 16; /* [31:16],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } se_sha_ctrl;

    /* 0x4 : se_sha_msa */
    union {
        struct {
            uint32_t se_sha_msa : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } se_sha_msa;

    /* 0x8 : se_sha_status */
    union {
        struct {
            uint32_t se_sha_status : 32; /* [31: 0],          r,       0x41 */
        } BF;
        uint32_t WORD;
    } se_sha_status;

    /* 0xc : se_sha_endian */
    union {
        struct {
            uint32_t se_sha_dout_endian : 1;  /* [    0],        r/w,        0x1 */
            uint32_t reserved_1_31      : 31; /* [31: 1],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } se_sha_endian;

    /* 0x10 : se_sha_hash_l_0 */
    union {
        struct {
            uint32_t se_sha_hash_l_0 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_sha_hash_l_0;

    /* 0x14 : se_sha_hash_l_1 */
    union {
        struct {
            uint32_t se_sha_hash_l_1 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_sha_hash_l_1;

