bouffalolab/bl_iot_sdk-components/platform/soc/bl702l/bl702l_std/BSP_Driver/regs/sec_eng_reg.h
    /* 0x18 : se_sha_hash_l_2 */
    union {
        struct {
            uint32_t se_sha_hash_l_2 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_sha_hash_l_2;

    /* 0x1c : se_sha_hash_l_3 */
    union {
        struct {
            uint32_t se_sha_hash_l_3 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_sha_hash_l_3;

    /* 0x20 : se_sha_hash_l_4 */
    union {
        struct {
            uint32_t se_sha_hash_l_4 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_sha_hash_l_4;

    /* 0x24 : se_sha_hash_l_5 */
    union {
        struct {
            uint32_t se_sha_hash_l_5 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_sha_hash_l_5;

    /* 0x28 : se_sha_hash_l_6 */
    union {
        struct {
            uint32_t se_sha_hash_l_6 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_sha_hash_l_6;

    /* 0x2c : se_sha_hash_l_7 */
    union {
        struct {
            uint32_t se_sha_hash_l_7 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_sha_hash_l_7;

    /* 0x30 : se_sha_hash_h_0 */
    union {
        struct {
            uint32_t se_sha_hash_h_0 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_sha_hash_h_0;

    /* 0x34 : se_sha_hash_h_1 */
    union {
        struct {
            uint32_t se_sha_hash_h_1 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_sha_hash_h_1;

    /* 0x38 : se_sha_hash_h_2 */
    union {
        struct {
            uint32_t se_sha_hash_h_2 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_sha_hash_h_2;

    /* 0x3c : se_sha_hash_h_3 */
    union {
        struct {
            uint32_t se_sha_hash_h_3 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_sha_hash_h_3;

    /* 0x40 : se_sha_hash_h_4 */
    union {
        struct {
            uint32_t se_sha_hash_h_4 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_sha_hash_h_4;

    /* 0x44 : se_sha_hash_h_5 */
    union {
        struct {
            uint32_t se_sha_hash_h_5 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_sha_hash_h_5;

    /* 0x48 : se_sha_hash_h_6 */
    union {
        struct {
            uint32_t se_sha_hash_h_6 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_sha_hash_h_6;

    /* 0x4c : se_sha_hash_h_7 */
    union {
        struct {
            uint32_t se_sha_hash_h_7 : 32; /* [31: 0],          r,        0x0 */
        } BF;
        uint32_t WORD;
    } se_sha_hash_h_7;

    /* 0x50 : se_sha_link */
    union {
        struct {
            uint32_t se_sha_lca : 32; /* [31: 0],        r/w,        0x0 */
        } BF;
        uint32_t WORD;
    } se_sha_link;

    /* 0x54  reserved */
    uint8_t RESERVED0x54[168];

    /* 0xfc : se_sha_ctrl_prot */
    union {
        struct {
            uint32_t reserved_0    : 1;  /* [    0],       rsvd,        0x0 */
            uint32_t se_sha_id0_en : 1;  /* [    1],        r/w,        0x1 */
            uint32_t se_sha_id1_en : 1;  /* [    2],        r/w,        0x1 */
            uint32_t reserved_3_31 : 29; /* [31: 3],       rsvd,        0x0 */
        } BF;
        uint32_t WORD;
    } se_sha_ctrl_prot;
};

typedef volatile struct sec_eng_sha_reg sec_eng_sha_reg_t;

#define SEC_ENG_SHA_OFFSET 0x000

/*Following is reg patch*/

/* 0x0 : se_aes_ctrl */
#define SEC_ENG_SE_AES_CTRL_OFFSET      (0x0)
#define SEC_ENG_SE_AES_BUSY             SEC_ENG_SE_AES_BUSY
#define SEC_ENG_SE_AES_BUSY_POS         (0U)
#define SEC_ENG_SE_AES_BUSY_LEN         (1U)
#define SEC_ENG_SE_AES_BUSY_MSK         (((1U << SEC_ENG_SE_AES_BUSY_LEN) - 1) << SEC_ENG_SE_AES_BUSY_POS)
#define SEC_ENG_SE_AES_BUSY_UMSK        (~(((1U << SEC_ENG_SE_AES_BUSY_LEN) - 1) << SEC_ENG_SE_AES_BUSY_POS))
#define SEC_ENG_SE_AES_TRIG_1T          SEC_ENG_SE_AES_TRIG_1T
#define SEC_ENG_SE_AES_TRIG_1T_POS      (1U)
#define SEC_ENG_SE_AES_TRIG_1T_LEN      (1U)
#define SEC_ENG_SE_AES_TRIG_1T_MSK      (((1U << SEC_ENG_SE_AES_TRIG_1T_LEN) - 1) << SEC_ENG_SE_AES_TRIG_1T_POS)
#define SEC_ENG_SE_AES_TRIG_1T_UMSK     (~(((1U << SEC_ENG_SE_AES_TRIG_1T_LEN) - 1) << SEC_ENG_SE_AES_TRIG_1T_POS))
#define SEC_ENG_SE_AES_EN               SEC_ENG_SE_AES_EN
#define SEC_ENG_SE_AES_EN_POS           (2U)
#define SEC_ENG_SE_AES_EN_LEN           (1U)
#define SEC_ENG_SE_AES_EN_MSK           (((1U << SEC_ENG_SE_AES_EN_LEN) - 1) << SEC_ENG_SE_AES_EN_POS)
#define SEC_ENG_SE_AES_EN_UMSK          (~(((1U << SEC_ENG_SE_AES_EN_LEN) - 1) << SEC_ENG_SE_AES_EN_POS))
#define SEC_ENG_SE_AES_MODE             SEC_ENG_SE_AES_MODE
#define SEC_ENG_SE_AES_MODE_POS         (3U)
#define SEC_ENG_SE_AES_MODE_LEN         (2U)
#define SEC_ENG_SE_AES_MODE_MSK         (((1U << SEC_ENG_SE_AES_MODE_LEN) - 1) << SEC_ENG_SE_AES_MODE_POS)
#define SEC_ENG_SE_AES_MODE_UMSK        (~(((1U << SEC_ENG_SE_AES_MODE_LEN) - 1) << SEC_ENG_SE_AES_MODE_POS))
#define SEC_ENG_SE_AES_DEC_EN           SEC_ENG_SE_AES_DEC_EN
#define SEC_ENG_SE_AES_DEC_EN_POS       (5U)
#define SEC_ENG_SE_AES_DEC_EN_LEN       (1U)
#define SEC_ENG_SE_AES_DEC_EN_MSK       (((1U << SEC_ENG_SE_AES_DEC_EN_LEN) - 1) << SEC_ENG_SE_AES_DEC_EN_POS)
#define SEC_ENG_SE_AES_DEC_EN_UMSK      (~(((1U << SEC_ENG_SE_AES_DEC_EN_LEN) - 1) << SEC_ENG_SE_AES_DEC_EN_POS))
#define SEC_ENG_SE_AES_DEC_KEY_SEL      SEC_ENG_SE_AES_DEC_KEY_SEL
#define SEC_ENG_SE_AES_DEC_KEY_SEL_POS  (6U)
#define SEC_ENG_SE_AES_DEC_KEY_SEL_LEN  (1U)
#define SEC_ENG_SE_AES_DEC_KEY_SEL_MSK  (((1U << SEC_ENG_SE_AES_DEC_KEY_SEL_LEN) - 1) << SEC_ENG_SE_AES_DEC_KEY_SEL_POS)
#define SEC_ENG_SE_AES_DEC_KEY_SEL_UMSK (~(((1U << SEC_ENG_SE_AES_DEC_KEY_SEL_LEN) - 1) << SEC_ENG_SE_AES_DEC_KEY_SEL_POS))
#define SEC_ENG_SE_AES_HW_KEY_EN        SEC_ENG_SE_AES_HW_KEY_EN
#define SEC_ENG_SE_AES_HW_KEY_EN_POS    (7U)
#define SEC_ENG_SE_AES_HW_KEY_EN_LEN    (1U)
#define SEC_ENG_SE_AES_HW_KEY_EN_MSK    (((1U << SEC_ENG_SE_AES_HW_KEY_EN_LEN) - 1) << SEC_ENG_SE_AES_HW_KEY_EN_POS)
#define SEC_ENG_SE_AES_HW_KEY_EN_UMSK   (~(((1U << SEC_ENG_SE_AES_HW_KEY_EN_LEN) - 1) << SEC_ENG_SE_AES_HW_KEY_EN_POS))
#define SEC_ENG_SE_AES_INT              SEC_ENG_SE_AES_INT
#define SEC_ENG_SE_AES_INT_POS          (8U)
#define SEC_ENG_SE_AES_INT_LEN          (1U)
#define SEC_ENG_SE_AES_INT_MSK          (((1U << SEC_ENG_SE_AES_INT_LEN) - 1) << SEC_ENG_SE_AES_INT_POS)
#define SEC_ENG_SE_AES_INT_UMSK         (~(((1U << SEC_ENG_SE_AES_INT_LEN) - 1) << SEC_ENG_SE_AES_INT_POS))
#define SEC_ENG_SE_AES_INT_CLR_1T       SEC_ENG_SE_AES_INT_CLR_1T
#define SEC_ENG_SE_AES_INT_CLR_1T_POS   (9U)
#define SEC_ENG_SE_AES_INT_CLR_1T_LEN   (1U)
#define SEC_ENG_SE_AES_INT_CLR_1T_MSK   (((1U << SEC_ENG_SE_AES_INT_CLR_1T_LEN) - 1) << SEC_ENG_SE_AES_INT_CLR_1T_POS)
#define SEC_ENG_SE_AES_INT_CLR_1T_UMSK  (~(((1U << SEC_ENG_SE_AES_INT_CLR_1T_LEN) - 1) << SEC_ENG_SE_AES_INT_CLR_1T_POS))
#define SEC_ENG_SE_AES_INT_SET_1T       SEC_ENG_SE_AES_INT_SET_1T
#define SEC_ENG_SE_AES_INT_SET_1T_POS   (10U)
#define SEC_ENG_SE_AES_INT_SET_1T_LEN   (1U)
#define SEC_ENG_SE_AES_INT_SET_1T_MSK   (((1U << SEC_ENG_SE_AES_INT_SET_1T_LEN) - 1) << SEC_ENG_SE_AES_INT_SET_1T_POS)
#define SEC_ENG_SE_AES_INT_SET_1T_UMSK  (~(((1U << SEC_ENG_SE_AES_INT_SET_1T_LEN) - 1) << SEC_ENG_SE_AES_INT_SET_1T_POS))
#define SEC_ENG_SE_AES_INT_MASK         SEC_ENG_SE_AES_INT_MASK
#define SEC_ENG_SE_AES_INT_MASK_POS     (11U)
#define SEC_ENG_SE_AES_INT_MASK_LEN     (1U)
#define SEC_ENG_SE_AES_INT_MASK_MSK     (((1U << SEC_ENG_SE_AES_INT_MASK_LEN) - 1) << SEC_ENG_SE_AES_INT_MASK_POS)
#define SEC_ENG_SE_AES_INT_MASK_UMSK    (~(((1U << SEC_ENG_SE_AES_INT_MASK_LEN) - 1) << SEC_ENG_SE_AES_INT_MASK_POS))
#define SEC_ENG_SE_AES_BLOCK_MODE       SEC_ENG_SE_AES_BLOCK_MODE
#define SEC_ENG_SE_AES_BLOCK_MODE_POS   (12U)
#define SEC_ENG_SE_AES_BLOCK_MODE_LEN   (2U)
#define SEC_ENG_SE_AES_BLOCK_MODE_MSK   (((1U << SEC_ENG_SE_AES_BLOCK_MODE_LEN) - 1) << SEC_ENG_SE_AES_BLOCK_MODE_POS)
#define SEC_ENG_SE_AES_BLOCK_MODE_UMSK  (~(((1U << SEC_ENG_SE_AES_BLOCK_MODE_LEN) - 1) << SEC_ENG_SE_AES_BLOCK_MODE_POS))
#define SEC_ENG_SE_AES_IV_SEL           SEC_ENG_SE_AES_IV_SEL
#define SEC_ENG_SE_AES_IV_SEL_POS       (14U)
#define SEC_ENG_SE_AES_IV_SEL_LEN       (1U)
#define SEC_ENG_SE_AES_IV_SEL_MSK       (((1U << SEC_ENG_SE_AES_IV_SEL_LEN) - 1) << SEC_ENG_SE_AES_IV_SEL_POS)
#define SEC_ENG_SE_AES_IV_SEL_UMSK      (~(((1U << SEC_ENG_SE_AES_IV_SEL_LEN) - 1) << SEC_ENG_SE_AES_IV_SEL_POS))
#define SEC_ENG_SE_AES_LINK_MODE        SEC_ENG_SE_AES_LINK_MODE
#define SEC_ENG_SE_AES_LINK_MODE_POS    (15U)
#define SEC_ENG_SE_AES_LINK_MODE_LEN    (1U)
#define SEC_ENG_SE_AES_LINK_MODE_MSK    (((1U << SEC_ENG_SE_AES_LINK_MODE_LEN) - 1) << SEC_ENG_SE_AES_LINK_MODE_POS)
#define SEC_ENG_SE_AES_LINK_MODE_UMSK   (~(((1U << SEC_ENG_SE_AES_LINK_MODE_LEN) - 1) << SEC_ENG_SE_AES_LINK_MODE_POS))
#define SEC_ENG_SE_AES_MSG_LEN          SEC_ENG_SE_AES_MSG_LEN
#define SEC_ENG_SE_AES_MSG_LEN_POS      (16U)
#define SEC_ENG_SE_AES_MSG_LEN_LEN      (16U)
#define SEC_ENG_SE_AES_MSG_LEN_MSK      (((1U << SEC_ENG_SE_AES_MSG_LEN_LEN) - 1) << SEC_ENG_SE_AES_MSG_LEN_POS)
#define SEC_ENG_SE_AES_MSG_LEN_UMSK     (~(((1U << SEC_ENG_SE_AES_MSG_LEN_LEN) - 1) << SEC_ENG_SE_AES_MSG_LEN_POS))

/* 0x4 : se_aes_msa */
#define SEC_ENG_SE_AES_MSA_OFFSET (0x4)
#define SEC_ENG_SE_AES_MSA        SEC_ENG_SE_AES_MSA
#define SEC_ENG_SE_AES_MSA_POS    (0U)
#define SEC_ENG_SE_AES_MSA_LEN    (32U)
#define SEC_ENG_SE_AES_MSA_MSK    (((1U << SEC_ENG_SE_AES_MSA_LEN) - 1) << SEC_ENG_SE_AES_MSA_POS)
#define SEC_ENG_SE_AES_MSA_UMSK   (~(((1U << SEC_ENG_SE_AES_MSA_LEN) - 1) << SEC_ENG_SE_AES_MSA_POS))

